vim.org
put in .vimrc file

#+begin_example
set relativenumber
set numberwidth=2
set cpoptions+=n
inoremap kj <esc>
vnoremap kj <esc>
syntax enable
colorscheme monokai
#+end_example

=mkdir ~/.vim/colors=\\
if directory not exist. then\\
[[https://github.com/sickill/vim-monokai][download monokai]]\\
and move to colors directory.\\
[[https://github.com/gkjgh/cobalt][cobalt]]\\
[[https://github.com/ErichDonGubler/vim-sublime-monokai][sublime
monokai]]

[[https://github.com/theicfire/vimsheet/blob/gh-pages/index.md][initial
version copied from here]] # A Great Vim Cheat Sheet

[[https://vim.rtorr.com/][vim_cheatsheet]]\\
[[https://vimsheet.com/][vim_cheatsheet]]\\
[[https://devhints.io][https://devhints.io/]]

[[https://github.com/VSCodeVim/Vim][vscode vim]]

[[https://github.com/philc/vimium][vim in the browser_ vimium]]

** Essentials
:PROPERTIES:
:CUSTOM_ID: essentials
:END:
*** Cursor movement (Normal/Visual Mode)
:PROPERTIES:
:CUSTOM_ID: cursor-movement-normalvisual-mode
:END:
- =h= =j= =k= =l= - Arrow keys
- =w= / =b= - Next/previous word
- =e= / =ge= - Next/previous *end* of word
- =0= / =$= - Start/End of line
- =^= - First non-blank character of line (same as =0w=)

*** Editing text
:PROPERTIES:
:CUSTOM_ID: editing-text
:END:
- =i= / *=a=* - Start insert mode at/ *after* cursor
- =I= / *=A=* - Start insert mode at the beginning/*end* of the line
- *=o=* / =O= - Add blank line *below*/above current line
- =Esc= or =Ctrl+[= - Exit insert mode
- =d= - Delete
- =dd= - Delete line

*** Operators
:PROPERTIES:
:CUSTOM_ID: operators
:END:
- Operators also work in Visual Mode
- =d= - Deletes from the cursor to the movement location
- =c= - Deletes from the cursor to the movement location, then starts
  insert mode
- =y= - Copy from the cursor to the movement location
- =>= - Indent one level
- =<= - Unindent one level
- You can also combine operators with motions. Ex: =d$= deletes from the
  cursor to the end of the line.

*** Marking text (visual mode)
:PROPERTIES:
:CUSTOM_ID: marking-text-visual-mode
:END:
- =v= - Start visual mode
- =V= - Start linewise visual mode
- =Ctrl+v= - Start visual block mode
- =Esc= or =Ctrl+[= - Exit visual mode ###### multicursor in block mode
- =Ctrl+v= -visual block, and then up or down give multicursor, with
  shift+i (I) insert mode and type

*** Clipboard
:PROPERTIES:
:CUSTOM_ID: clipboard
:END:
- =yy= - Yank (copy) a line
- =p= - Paste after cursor
- =P= - Paste before cursor
- =dd= - Delete (cut) a line
- =x= - Delete (cut) current character
- =X= - Delete (cut) previous character
- =d= / =c= - By default, these copy the deleted text

**** delete
:PROPERTIES:
:CUSTOM_ID: delete
:END:
- [[https://github.com/tsironis/vim-cheat/blob/master/cheatsheet.md][link]]\\
  *ci(xyz[Esc]* - This is a weird one. Here, the 'i' does not mean
  insert mode. Instead it means *inside the parenthesis*. So this
  sequence cuts the text inside parenthesis you're standing in and
  replaces it with "xyz". It also works inside square and figure
  brackets -- just do ci[ or ci{ correspondingly. Naturally, you can do
  di (if you just want to delete all text without typing anything. You
  can also do a instead of i if you want to delete the parentheses as
  well and not just text inside them.

- =de= - Delete everything till the end of the word

- =dt.= - delete until next dot .

- =diw= - to delete the current word

- =capital D= - (take a deep breath) Deletes the rest of the line to the
  right of the cursor

- =di(= - to delete within (). akks (aksalsk) alks -> akks () alks

- =di{= - to delete within {}

- =di[= - to delete within []

- =di"= - to delete the text between the quotes “”

- =dab= - "delete arounb brackets" []

- =da[= - delete around bracket [], da( and da{ for other. so it delete
  with paren aks (alksj) aak -> aks aak

- =daB= for around curly brackets, {}, t for xml type tags, combinations
  with normal commands are as expected cib/yaB/dit/vat etc

- =ci(= - delete and insert cursor

- =ci{=

- =ci[=

- =vi(= select in visual mode\\

- *summary* =di(= delete inside text, =ci(= delete inside text and
  insert mode. =da(= delete inside text + () , =ca(= delete inside text+
  () and insert mode.\\

- =vi(= - visually select inside (), =va(= select text+()\\

- =yi(= - copy inside () and =ya(= copy inside text + ()

- [[https://github.com/tpope/vim-surround][see also vim surround]]

- [[https://github.com/emacs-evil/evil-surround][emacs evil-surround]]

- some text > visually select =some text= > =S"= (capital S) > "some
  text"

- some text > cursor on some > =ysiw"= > "some" text

- "some text" > cursor inside > =cs"'= > 'some text'\\

- "some text" > cursor inside > =cs"=( > (some text)\\

- "some text" > cursor inside > =ds"= > some text\\

- some text > cursor in some > =ys2e"= > "some text"

**** faq
:PROPERTIES:
:CUSTOM_ID: faq
:END:
How to duplicate a whole line in Vim? - yy or Y copy the line and p
paste the line down and P(upper) paste above current line - 2yy can be
used to copy 2 lines (and for any other n) - dd or D delete the line and
p paste the line

*** Exiting
:PROPERTIES:
:CUSTOM_ID: exiting
:END:
- =:w= - Write (save) the file, but don't quit
- =:wq= - Write (save) and quit
- =:q= - Quit (fails if anything has changed)
- =:q!= - Quit and throw away changes

