vim.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-12 Wed 16:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Yousuf Ali" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3153ffa">0.1. Essentials</a>
<ul>
<li><a href="#org89ff577">0.1.1. Cursor movement (Normal/Visual Mode)</a></li>
<li><a href="#org4460f98">0.1.2. Editing text</a></li>
<li><a href="#orgc81efa0">0.1.3. Operators</a></li>
<li><a href="#orgb3abdba">0.1.4. Marking text (visual mode)</a></li>
<li><a href="#org94e8d7f">0.1.5. Clipboard</a></li>
<li><a href="#org57247fc">0.1.6. Exiting</a></li>
<li><a href="#org5840402">0.1.7. Search/Replace</a></li>
<li><a href="#org3358b15">0.1.8. General</a></li>
</ul>
</li>
<li><a href="#org7154f80">0.2. Advanced</a>
<ul>
<li><a href="#orgb0c257c">0.2.1. Cursor movement</a></li>
<li><a href="#org1a7d7df">0.2.2. Character search</a></li>
<li><a href="#orgd667654">0.2.3. Editing text</a></li>
<li><a href="#org7e31f7b">0.2.4. Visual mode</a></li>
<li><a href="#org70b83fa">0.2.5. File Tabs</a></li>
<li><a href="#org2db9950">0.2.6. Marks</a></li>
<li><a href="#orge8ffd2b">0.2.7. macros</a></li>
<li><a href="#org84d3eec">0.2.8. register</a></li>
<li><a href="#org527b68b">0.2.9. Text Objects</a></li>
<li><a href="#org8be221b">0.2.10. General</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org240a320">1. Making VIM actually useful</a>
<ul>
<li><a href="#org035b366">1.1. Switch caps lock and escape</a></li>
<li><a href="#org9668d76">1.2. Visual Studio Code</a></li>
<li><a href="#org49e1312">1.3. Configure native VIM</a>
<ul>
<li><a href="#org6500eb9">1.3.1. Using the system clipboard</a></li>
</ul>
</li>
<li><a href="#org5168236">1.4. Sublime Text</a></li>
<li><a href="#orgcea28ea">1.5. Other</a></li>
<li><a href="#orgbcca343">1.6. Additional resources</a></li>
</ul>
</div>
</div>
<p>
put in .vimrc file
</p>

<pre class="example" id="org7da191d">
set relativenumber
set numberwidth=2
set cpoptions+=n
inoremap kj &lt;esc&gt;
vnoremap kj &lt;esc&gt;
syntax enable
colorscheme monokai
</pre>

<p>
<code>mkdir ~/.vim/colors</code><br />
if directory not exist. then<br />
<a href="https://github.com/sickill/vim-monokai">download monokai</a><br />
and move to colors directory.<br />
<a href="https://github.com/gkjgh/cobalt">cobalt</a><br />
<a href="https://github.com/ErichDonGubler/vim-sublime-monokai">sublime
monokai</a>
</p>

<p>
<a href="https://github.com/theicfire/vimsheet/blob/gh-pages/index.md">initial
version copied from here</a> # A Great Vim Cheat Sheet
</p>

<p>
<a href="https://vim.rtorr.com/">vim<sub>cheatsheet</sub></a><br />
<a href="https://vimsheet.com/">vim<sub>cheatsheet</sub></a><br />
<a href="https://devhints.io">https://devhints.io/</a>
</p>

<p>
<a href="https://github.com/VSCodeVim/Vim">vscode vim</a>
</p>

<p>
<a href="https://github.com/philc/vimium">vim in the browser_ vimium</a>
</p>

<div id="outline-container-org3153ffa" class="outline-3">
<h3 id="org3153ffa"><span class="section-number-3">0.1.</span> Essentials</h3>
<div class="outline-text-3" id="text-0-1">
</div>
<div id="outline-container-org89ff577" class="outline-4">
<h4 id="org89ff577"><span class="section-number-4">0.1.1.</span> Cursor movement (Normal/Visual Mode)</h4>
<div class="outline-text-4" id="text-0-1-1">
<ul class="org-ul">
<li><code>h</code> <code>j</code> <code>k</code> <code>l</code> - Arrow keys</li>
<li><code>w</code> / <code>b</code> - Next/previous word</li>
<li><code>e</code> / <code>ge</code> - Next/previous <b>end</b> of word</li>
<li><code>0</code> / <code>$</code> - Start/End of line</li>
<li><code>^</code> - First non-blank character of line (same as <code>0w</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org4460f98" class="outline-4">
<h4 id="org4460f98"><span class="section-number-4">0.1.2.</span> Editing text</h4>
<div class="outline-text-4" id="text-0-1-2">
<ul class="org-ul">
<li><code>i</code> / <b><code>a</code></b> - Start insert mode at/ <b>after</b> cursor</li>
<li><code>I</code> / <b><code>A</code></b> - Start insert mode at the beginning/*end* of the line</li>
<li><b><code>o</code></b> / <code>O</code> - Add blank line *below*/above current line</li>
<li><code>Esc</code> or <code>Ctrl+[</code> - Exit insert mode</li>
<li><code>d</code> - Delete</li>
<li><code>dd</code> - Delete line</li>
</ul>
</div>
</div>

<div id="outline-container-orgc81efa0" class="outline-4">
<h4 id="orgc81efa0"><span class="section-number-4">0.1.3.</span> Operators</h4>
<div class="outline-text-4" id="text-0-1-3">
<ul class="org-ul">
<li>Operators also work in Visual Mode</li>
<li><code>d</code> - Deletes from the cursor to the movement location</li>
<li><code>c</code> - Deletes from the cursor to the movement location, then starts
insert mode</li>
<li><code>y</code> - Copy from the cursor to the movement location</li>
<li><code>&gt;</code> - Indent one level</li>
<li><code>&lt;</code> - Unindent one level</li>
<li>You can also combine operators with motions. Ex: <code>d$</code> deletes from the
cursor to the end of the line.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3abdba" class="outline-4">
<h4 id="orgb3abdba"><span class="section-number-4">0.1.4.</span> Marking text (visual mode)</h4>
<div class="outline-text-4" id="text-0-1-4">
<ul class="org-ul">
<li><code>v</code> - Start visual mode</li>
<li><code>V</code> - Start linewise visual mode</li>
<li><code>Ctrl+v</code> - Start visual block mode</li>
<li><code>Esc</code> or <code>Ctrl+[</code> - Exit visual mode ###### multicursor in block mode</li>
<li><code>Ctrl+v</code> -visual block, and then up or down give multicursor, with
shift+i (I) insert mode and type</li>
</ul>
</div>
</div>

<div id="outline-container-org94e8d7f" class="outline-4">
<h4 id="org94e8d7f"><span class="section-number-4">0.1.5.</span> Clipboard</h4>
<div class="outline-text-4" id="text-0-1-5">
<ul class="org-ul">
<li><code>yy</code> - Yank (copy) a line</li>
<li><code>p</code> - Paste after cursor</li>
<li><code>P</code> - Paste before cursor</li>
<li><code>dd</code> - Delete (cut) a line</li>
<li><code>x</code> - Delete (cut) current character</li>
<li><code>X</code> - Delete (cut) previous character</li>
<li><code>d</code> / <code>c</code> - By default, these copy the deleted text</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgc4f10c4"></a>delete<br />
<div class="outline-text-5" id="text-0-1-5-1">
<ul class="org-ul">
<li><a href="https://github.com/tsironis/vim-cheat/blob/master/cheatsheet.md">link</a><br />
<b>ci(xyz[Esc]</b> - This is a weird one. Here, the &rsquo;i&rsquo; does not mean
insert mode. Instead it means <b>inside the parenthesis</b>. So this
sequence cuts the text inside parenthesis you&rsquo;re standing in and
replaces it with &ldquo;xyz&rdquo;. It also works inside square and figure
brackets &#x2013; just do ci[ or ci{ correspondingly. Naturally, you can do
di (if you just want to delete all text without typing anything. You
can also do a instead of i if you want to delete the parentheses as
well and not just text inside them.</li>

<li><code>de</code> - Delete everything till the end of the word</li>

<li><code>dt.</code> - delete until next dot .</li>

<li><code>diw</code> - to delete the current word</li>

<li><code>capital D</code> - (take a deep breath) Deletes the rest of the line to the
right of the cursor</li>

<li><code>di(</code> - to delete within (). akks (aksalsk) alks -&gt; akks () alks</li>

<li><code>di{</code> - to delete within {}</li>

<li><code>di[</code> - to delete within []</li>

<li><code>di"</code> - to delete the text between the quotes “”</li>

<li><code>dab</code> - &ldquo;delete arounb brackets&rdquo; []</li>

<li><code>da[</code> - delete around bracket [], da( and da{ for other. so it delete
with paren aks (alksj) aak -&gt; aks aak</li>

<li><code>daB</code> for around curly brackets, {}, t for xml type tags, combinations
with normal commands are as expected cib/yaB/dit/vat etc</li>

<li><code>ci(</code> - delete and insert cursor</li>

<li><code>ci{</code></li>

<li><code>ci[</code></li>

<li><code>vi(</code> select in visual mode<br /></li>

<li><b>summary</b> <code>di(</code> delete inside text, <code>ci(</code> delete inside text and
insert mode. <code>da(</code> delete inside text + () , <code>ca(</code> delete inside text+
() and insert mode.<br /></li>

<li><code>vi(</code> - visually select inside (), <code>va(</code> select text+()<br /></li>

<li><code>yi(</code> - copy inside () and <code>ya(</code> copy inside text + ()</li>

<li><a href="https://github.com/tpope/vim-surround">see also vim surround</a></li>

<li><a href="https://github.com/emacs-evil/evil-surround">emacs evil-surround</a></li>

<li>some text &gt; visually select <code>some text</code> &gt; <code>S"</code> (capital S) &gt; &ldquo;some
text&rdquo;</li>

<li>some text &gt; cursor on some &gt; <code>ysiw"</code> &gt; &ldquo;some&rdquo; text</li>

<li>&ldquo;some text&rdquo; &gt; cursor inside &gt; <code>cs"'</code> &gt; &rsquo;some text&rsquo;<br /></li>

<li>&ldquo;some text&rdquo; &gt; cursor inside &gt; =cs&ldquo;=( &gt; (some text)<br /></li>

<li>&ldquo;some text&rdquo; &gt; cursor inside &gt; <code>ds"</code> &gt; some text<br /></li>

<li>some text &gt; cursor in some &gt; <code>ys2e"</code> &gt; &ldquo;some text&rdquo;</li>
</ul>
</div>
</li>

<li><a id="org58a45d6"></a>faq<br />
<div class="outline-text-5" id="text-0-1-5-2">
<p>
How to duplicate a whole line in Vim? - yy or Y copy the line and p
paste the line down and P(upper) paste above current line - 2yy can be
used to copy 2 lines (and for any other n) - dd or D delete the line and
p paste the line
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org57247fc" class="outline-4">
<h4 id="org57247fc"><span class="section-number-4">0.1.6.</span> Exiting</h4>
<div class="outline-text-4" id="text-0-1-6">
<ul class="org-ul">
<li><code>:w</code> - Write (save) the file, but don&rsquo;t quit</li>
<li><code>:wq</code> - Write (save) and quit</li>
<li><code>:q</code> - Quit (fails if anything has changed)</li>
<li><code>:q!</code> - Quit and throw away changes</li>
</ul>
</div>
</div>
