vim.org
*** Search/Replace
:PROPERTIES:
:CUSTOM_ID: searchreplace
:END:
- =/pattern= - Search for pattern
- =?pattern= - Search backward for pattern
- =n= - Repeat search in same direction
- =N= - Repeat search in opposite direction
- =:%s/old/new/g= - Replace all old with new throughout file
  ([[http://vimcasts.org/episodes/operating-on-search-matches-using-gn/][gn]]
  is better though)
- =:%s/old/new/gc= - Replace all old with new throughout file with
  confirmations
- =:noh= - To turn off highlighting until the next search
- =q/= - show recent search term
- =*= - forward search word under cursor (very helpful)
- =#= - backword search word under cursor

*** General
:PROPERTIES:
:CUSTOM_ID: general
:END:
- =u= - Undo
- =Ctrl+r= - Redo

** Advanced
:PROPERTIES:
:CUSTOM_ID: advanced
:END:
*** Cursor movement
:PROPERTIES:
:CUSTOM_ID: cursor-movement
:END:
- =Ctrl+d= - Move down half a page
- =Ctrl+u= - Move up half a page
- =Ctrl+b= - Move up whole page
- =Ctrl+e= - scroll down by line
- =Ctrl+y= - scroll up by line
- =}= - Go forward by paragraph (the next blank line)
- ={= - Go backward by paragraph (the next blank line)
- *=gg=* - Go to the top of the page
- *=G=* - Go the bottom of the page
- =: [num] [enter]= - Go to that line in the document
- =ctrl+e / ctrl+y= - Scroll down/up one line\\
- [[https://stackoverflow.com/questions/3458689/how-to-move-screen-without-moving-cursor-in-vim/58326724#58326724][stackoverflow]]\\
  z t ...or... z enter --> moves current line to top of screen\\
  z z ...or... z . --> moves current line to center of screen\\
  z b ...or... z - --> moves current line to bottom\\
  For what it's worth, z. avoids the danger of saving and closing Vi by
  accidentally typing\\
  ZZ if the caps-lock is on.

*** Character search
:PROPERTIES:
:CUSTOM_ID: character-search
:END:
- *=f [char]=* - *Move forward to the given char*
- =F [char]= - Move backward to the given char
- =t [char]= - Move forward to before the given char
- =T [char]= - Move backward to before the given char
- =;= / =,= - Repeat search forwards/backwards

*** Editing text
:PROPERTIES:
:CUSTOM_ID: editing-text-1
:END:
- =J= - Join line below to the current one
- =r [char]= - Replace a single character with the specified char (does
  not use Insert mode)

*** Visual mode
:PROPERTIES:
:CUSTOM_ID: visual-mode
:END:
- =O= - Move to other corner of block
- =o= - Move to other end of marked area

*** File Tabs
:PROPERTIES:
:CUSTOM_ID: file-tabs
:END:
- =:e filename= - Edit a file
- =:tabe= - Make a new tab
- *=gt=* - *Go to the next tab*
- =gT= - Go to the previous tab
- *=:vsp=* - *Vertically split windows*
- *=:split=* - *horizontally split*
- =ctrl+ws= - Split windows horizontally
- =ctrl+wv= - Split windows vertically
- =ctrl+ww= - Switch between windows
- =ctrl+wq= - Quit a window

*** Marks
:PROPERTIES:
:CUSTOM_ID: marks
:END:
- ='= single quote
- Marks allow you to jump to designated points in your code.
- =m{a-z}= - Set mark {a-z} at cursor position
- A capital mark {A-Z} sets a global mark and will work between files
- ='{a-z}= - Move the cursor to the start of the line where the mark was
  set
- =''= - Go back to the previous jump location

*** macros
:PROPERTIES:
:CUSTOM_ID: macros
:END:
- =q{a-z}= record macro in a-z character
- =q= to stop
- =@{a-z}= play macro

*** register
:PROPERTIES:
:CUSTOM_ID: register
:END:
- ="{a-z}motion= to copy/yank/change/delete into letter
- ="{a-z}p= to paste
- ="ayiw=
- ="a= tells Vim that the next action (delete / change / yank) will be
  stored in register a.\\
- =yiw= yanks the word.
- To get the text from register a, run ="ap=

*** Text Objects
:PROPERTIES:
:CUSTOM_ID: text-objects
:END:
- Say you have =def (arg1, arg2, arg3)=, where your cursor is somewhere
  in the middle of the parenthesis.
- =di(= deletes everything between the parenthesis. That says "change
  everything inside the nearest parenthesis". Without text objects, you
  would need to do =T(dt)=.
- [[http://blog.carbonfive.com/2011/10/17/vim-text-objects-the-definitive-guide/][Learn
  more]]

*** General
:PROPERTIES:
:CUSTOM_ID: general-1
:END:
- =.= - Repeat last command
- =Ctrl+r + 0= in insert mode inserts the last yanked text (or in
  command mode)
- =gv= - reselect (select last selected block of text, from visual mode)
- =%= - jumps between matching =()= or ={}=

* Making VIM actually useful
:PROPERTIES:
:CUSTOM_ID: making-vim-actually-useful
:END:
Vim is quite unpleasant out of the box. It's an arcane experience:

- Autocomplete is missing
- System clipboard is not used
- Act of typing =:w= to save is cumbersome
- Mouse doesn't work
- Management of multiple files is tricky
- Integration with other plugins (like compiler warnings) is challenging
- Repeatedly indenting/unindenting multiple lines is challenging, though
  possible

It does have a significant strength though: your fingers can stay on the
main keyboard keys to do most editing actions. This is faster and more
ergonomic. I find that the toughest part about VIM is guiding people
towards getting the benefits of VIM without the drawbacks. Here are some
ideas on how to go about this.

** Switch caps lock and escape
:PROPERTIES:
:CUSTOM_ID: switch-caps-lock-and-escape
:END:
- I highly recommend you switch the mapping of your caps lock and escape
  keys. You'll love it, promise! Switching the two keys is platform
  dependent.

