vim.html

<div id="outline-container-org5840402" class="outline-4">
<h4 id="org5840402"><span class="section-number-4">0.1.7.</span> Search/Replace</h4>
<div class="outline-text-4" id="text-0-1-7">
<ul class="org-ul">
<li><code>/pattern</code> - Search for pattern</li>
<li><code>?pattern</code> - Search backward for pattern</li>
<li><code>n</code> - Repeat search in same direction</li>
<li><code>N</code> - Repeat search in opposite direction</li>
<li><code>:%s/old/new/g</code> - Replace all old with new throughout file
(<a href="http://vimcasts.org/episodes/operating-on-search-matches-using-gn/">gn</a>
is better though)</li>
<li><code>:%s/old/new/gc</code> - Replace all old with new throughout file with
confirmations</li>
<li><code>:noh</code> - To turn off highlighting until the next search</li>
<li><code>q/</code> - show recent search term</li>
<li><code>*</code> - forward search word under cursor (very helpful)</li>
<li><code>#</code> - backword search word under cursor</li>
</ul>
</div>
</div>

<div id="outline-container-org3358b15" class="outline-4">
<h4 id="org3358b15"><span class="section-number-4">0.1.8.</span> General</h4>
<div class="outline-text-4" id="text-0-1-8">
<ul class="org-ul">
<li><code>u</code> - Undo</li>
<li><code>Ctrl+r</code> - Redo</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7154f80" class="outline-3">
<h3 id="org7154f80"><span class="section-number-3">0.2.</span> Advanced</h3>
<div class="outline-text-3" id="text-0-2">
</div>
<div id="outline-container-orgb0c257c" class="outline-4">
<h4 id="orgb0c257c"><span class="section-number-4">0.2.1.</span> Cursor movement</h4>
<div class="outline-text-4" id="text-0-2-1">
<ul class="org-ul">
<li><code>Ctrl+d</code> - Move down half a page</li>
<li><code>Ctrl+u</code> - Move up half a page</li>
<li><code>Ctrl+b</code> - Move up whole page</li>
<li><code>Ctrl+e</code> - scroll down by line</li>
<li><code>Ctrl+y</code> - scroll up by line</li>
<li><code>}</code> - Go forward by paragraph (the next blank line)</li>
<li><code>{</code> - Go backward by paragraph (the next blank line)</li>
<li><b><code>gg</code></b> - Go to the top of the page</li>
<li><b><code>G</code></b> - Go the bottom of the page</li>
<li><code>: [num] [enter]</code> - Go to that line in the document</li>
<li><code>ctrl+e / ctrl+y</code> - Scroll down/up one line<br /></li>
<li><a href="https://stackoverflow.com/questions/3458689/how-to-move-screen-without-moving-cursor-in-vim/58326724#58326724">stackoverflow</a><br />
z t &#x2026;or&#x2026; z enter &#x2013;&gt; moves current line to top of screen<br />
z z &#x2026;or&#x2026; z . &#x2013;&gt; moves current line to center of screen<br />
z b &#x2026;or&#x2026; z - &#x2013;&gt; moves current line to bottom<br />
For what it&rsquo;s worth, z. avoids the danger of saving and closing Vi by
accidentally typing<br />
ZZ if the caps-lock is on.</li>
</ul>
</div>
</div>

<div id="outline-container-org1a7d7df" class="outline-4">
<h4 id="org1a7d7df"><span class="section-number-4">0.2.2.</span> Character search</h4>
<div class="outline-text-4" id="text-0-2-2">
<ul class="org-ul">
<li><b><code>f [char]</code></b> - <b>Move forward to the given char</b></li>
<li><code>F [char]</code> - Move backward to the given char</li>
<li><code>t [char]</code> - Move forward to before the given char</li>
<li><code>T [char]</code> - Move backward to before the given char</li>
<li><code>;</code> / <code>,</code> - Repeat search forwards/backwards</li>
</ul>
</div>
</div>

<div id="outline-container-orgd667654" class="outline-4">
<h4 id="orgd667654"><span class="section-number-4">0.2.3.</span> Editing text</h4>
<div class="outline-text-4" id="text-0-2-3">
<ul class="org-ul">
<li><code>J</code> - Join line below to the current one</li>
<li><code>r [char]</code> - Replace a single character with the specified char (does
not use Insert mode)</li>
</ul>
</div>
</div>

<div id="outline-container-org7e31f7b" class="outline-4">
<h4 id="org7e31f7b"><span class="section-number-4">0.2.4.</span> Visual mode</h4>
<div class="outline-text-4" id="text-0-2-4">
<ul class="org-ul">
<li><code>O</code> - Move to other corner of block</li>
<li><code>o</code> - Move to other end of marked area</li>
</ul>
</div>
</div>

<div id="outline-container-org70b83fa" class="outline-4">
<h4 id="org70b83fa"><span class="section-number-4">0.2.5.</span> File Tabs</h4>
<div class="outline-text-4" id="text-0-2-5">
<ul class="org-ul">
<li><code>:e filename</code> - Edit a file</li>
<li><code>:tabe</code> - Make a new tab</li>
<li><b><code>gt</code></b> - <b>Go to the next tab</b></li>
<li><code>gT</code> - Go to the previous tab</li>
<li><b><code>:vsp</code></b> - <b>Vertically split windows</b></li>
<li><b><code>:split</code></b> - <b>horizontally split</b></li>
<li><code>ctrl+ws</code> - Split windows horizontally</li>
<li><code>ctrl+wv</code> - Split windows vertically</li>
<li><code>ctrl+ww</code> - Switch between windows</li>
<li><code>ctrl+wq</code> - Quit a window</li>
</ul>
</div>
</div>

<div id="outline-container-org2db9950" class="outline-4">
<h4 id="org2db9950"><span class="section-number-4">0.2.6.</span> Marks</h4>
<div class="outline-text-4" id="text-0-2-6">
<ul class="org-ul">
<li><code>'</code> single quote</li>
<li>Marks allow you to jump to designated points in your code.</li>
<li><code>m{a-z}</code> - Set mark {a-z} at cursor position</li>
<li>A capital mark {A-Z} sets a global mark and will work between files</li>
<li><code>'{a-z}</code> - Move the cursor to the start of the line where the mark was
set</li>
<li><code>''</code> - Go back to the previous jump location</li>
</ul>
</div>
</div>

<div id="outline-container-orge8ffd2b" class="outline-4">
<h4 id="orge8ffd2b"><span class="section-number-4">0.2.7.</span> macros</h4>
<div class="outline-text-4" id="text-0-2-7">
<ul class="org-ul">
<li><code>q{a-z}</code> record macro in a-z character</li>
<li><code>q</code> to stop</li>
<li><code>@{a-z}</code> play macro</li>
</ul>
</div>
</div>

<div id="outline-container-org84d3eec" class="outline-4">
<h4 id="org84d3eec"><span class="section-number-4">0.2.8.</span> register</h4>
<div class="outline-text-4" id="text-0-2-8">
<ul class="org-ul">
<li><code>"{a-z}motion</code> to copy/yank/change/delete into letter</li>
<li><code>"{a-z}p</code> to paste</li>
<li><code>"ayiw</code></li>
<li><code>"a</code> tells Vim that the next action (delete / change / yank) will be
stored in register a.<br /></li>
<li><code>yiw</code> yanks the word.</li>
<li>To get the text from register a, run <code>"ap</code></li>
</ul>
</div>
</div>

<div id="outline-container-org527b68b" class="outline-4">
<h4 id="org527b68b"><span class="section-number-4">0.2.9.</span> Text Objects</h4>
<div class="outline-text-4" id="text-0-2-9">
<ul class="org-ul">
<li>Say you have <code>def (arg1, arg2, arg3)</code>, where your cursor is somewhere
in the middle of the parenthesis.</li>
<li><code>di(</code> deletes everything between the parenthesis. That says &ldquo;change
everything inside the nearest parenthesis&rdquo;. Without text objects, you
would need to do <code>T(dt)</code>.</li>
<li><a href="http://blog.carbonfive.com/2011/10/17/vim-text-objects-the-definitive-guide/">Learn
more</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8be221b" class="outline-4">
<h4 id="org8be221b"><span class="section-number-4">0.2.10.</span> General</h4>
<div class="outline-text-4" id="text-0-2-10">
<ul class="org-ul">
<li><code>.</code> - Repeat last command</li>
<li><code>Ctrl+r + 0</code> in insert mode inserts the last yanked text (or in
command mode)</li>
<li><code>gv</code> - reselect (select last selected block of text, from visual mode)</li>
<li><code>%</code> - jumps between matching <code>()</code> or <code>{}</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org240a320" class="outline-2">
<h2 id="org240a320"><span class="section-number-2">1.</span> Making VIM actually useful</h2>
<div class="outline-text-2" id="text-1">
<p>
Vim is quite unpleasant out of the box. It&rsquo;s an arcane experience:
</p>

<ul class="org-ul">
<li>Autocomplete is missing</li>
<li>System clipboard is not used</li>
<li>Act of typing <code>:w</code> to save is cumbersome</li>
<li>Mouse doesn&rsquo;t work</li>
<li>Management of multiple files is tricky</li>
<li>Integration with other plugins (like compiler warnings) is challenging</li>
<li>Repeatedly indenting/unindenting multiple lines is challenging, though
possible</li>
</ul>

<p>
It does have a significant strength though: your fingers can stay on the
main keyboard keys to do most editing actions. This is faster and more
ergonomic. I find that the toughest part about VIM is guiding people
towards getting the benefits of VIM without the drawbacks. Here are some
ideas on how to go about this.
</p>
</div>

<div id="outline-container-org035b366" class="outline-3">
<h3 id="org035b366"><span class="section-number-3">1.1.</span> Switch caps lock and escape</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>I highly recommend you switch the mapping of your caps lock and escape
keys. You&rsquo;ll love it, promise! Switching the two keys is platform
dependent.</li>
</ul>
</div>
</div>
