vim.org
** Visual Studio Code
:PROPERTIES:
:CUSTOM_ID: visual-studio-code
:END:
gb - adds another cursor on the next word it finds which is the same as
the word under the cursor.\\
gh - equivalent to hovering your mouse over wherever the cursor is.
Handy for seeing types and error messages without reaching for the
mouse!

- VSCode is the simplest way to give you a fantastic editor that also
  gives you the benefits of VIM. Just install
  [[https://marketplace.visualstudio.com/items?itemName=vscodevim.vim][the
  VIM extension]].
- I made a
  [[https://gist.github.com/theicfire/dc3f7f8c9a19467643a58dff22eb00d9][few
  slight changes]] which improved the experience for me.

** Configure native VIM
:PROPERTIES:
:CUSTOM_ID: configure-native-vim
:END:
For all the given limitations, you'll need to find a solution. You can
either solve the issues one by one, or you can use a reference .vimrc
settings file that fix most of the issues out-of-the-box.

- [[https://github.com/theicfire/dotfiles/blob/master/vim/.vimrc][My
  .vimrc file]] could be a good starting point. Honestly, it's a bit old
  and not the best. I now use VSCode mainly so I haven't kept a great
  vimrc.

*** Using the system clipboard
:PROPERTIES:
:CUSTOM_ID: using-the-system-clipboard
:END:
- ="+y= copy a selection to the system clipboard
- ="+p= paste from the system clipboard
- If this doesn't work, it's probably because Vim was not built with the
  system clipboard option. To check, run =vim --version= and see if
  =+clipboard= exists. If it says =-clipboard=, you will not be able to
  copy from outside of Vim.
  - For Mac users, homebrew install Vim with the clipboard option.
    Install homebrew and then run =brew install vim=.
    - then move the old Vim binary: =$ mv /usr/bin/vim /usr/bin/vimold=
    - restart your terminal and you should see =vim --version= now with
      =+clipboard=

** Sublime Text
:PROPERTIES:
:CUSTOM_ID: sublime-text
:END:
- Another option is to use Vintageous in Sublime Text (version 3). This
  gives you Vim mode inside Sublime. I suggest this (or a similar setup
  with the Atom editor) if you aren't a Vim master. Check out
  [[file:advanced.html][Advanced Vim]] if you are.

- Vintageous is great, but I suggest you change a few settings to make
  it better.

  - Clone [[https://github.com/theicfire/Vintageous][this repository]]
    to =~/.config/sublime-text-3/Packages/Vintageous=, or similar. Then
    check out the "custom" branch.
    - Alternatively, you can get a more updated Vintageous version by
      cloning [[https://github.com/guillermooo/Vintageous][the
      official]] repository and then copying over
      [[https://github.com/theicfire/Vintageous/commit/19ff6311b01e3ae259b7eb8e3944687b42ba06ff][this
      patch]].
  - Change the user settings (=User/Preferences.sublime-settings=) to
    include:
    - ="caret_style": "solid"=
    - This will make the cursor not blink, like in Vim.
    - Sublime Text might freeze when you do this. It's a bug; just
      restart Sublime Text after changing the file.
  - =ctrl+r= in Vim means "redo". But there is a handy Ctrl + R shortcut
    in Sublime Text that gives an "outline" of a file. I remapped it to
    alt+r by putting this in the User keymap
    - ={ "keys": ["alt+r"], "command": "show_overlay", "args": {"overlay": "goto", "text": "@"} },=
  - [[https://github.com/guillermooo/Vintageous/wiki/Toggling-Vintageous][Add
    the ability to toggle Vintageous on and off]]
  - Mac users: you will not have the ability to hold down a navigation
    key (like holding j to go down). To fix this, run the commands
    specified here: [[https://gist.github.com/kconragan/2510186]]

- Now you should be able to restart sublime and have a great Vim
  environment! Sweet Dude.

** Other
:PROPERTIES:
:CUSTOM_ID: other
:END:
I don't personally use these yet, but I've heard other people do!

- =:qa= - Quit all open tabs (thanks Vince Banzon)
- =:wa= - Write all open tabs (thanks Vince Banzon)
- =:wqa= - Write and quit all open tabs (thanks Brian Zick)

** Additional resources
:PROPERTIES:
:CUSTOM_ID: additional-resources
:END:
- [[file:advanced.html][Advanced Vim]]
- [[http://www.amazon.com/Practical-Vim-Thought-Pragmatic-Programmers/dp/1934356980][Practical
  Vim]] is a fantastic resource on many of the useful hidden features of
  vim.
