vim.html

<div id="outline-container-org9668d76" class="outline-3">
<h3 id="org9668d76"><span class="section-number-3">1.2.</span> Visual Studio Code</h3>
<div class="outline-text-3" id="text-1-2">
<p>
gb - adds another cursor on the next word it finds which is the same as
the word under the cursor.<br />
gh - equivalent to hovering your mouse over wherever the cursor is.
Handy for seeing types and error messages without reaching for the
mouse!
</p>

<ul class="org-ul">
<li>VSCode is the simplest way to give you a fantastic editor that also
gives you the benefits of VIM. Just install
<a href="https://marketplace.visualstudio.com/items?itemName=vscodevim.vim">the
VIM extension</a>.</li>
<li>I made a
<a href="https://gist.github.com/theicfire/dc3f7f8c9a19467643a58dff22eb00d9">few
slight changes</a> which improved the experience for me.</li>
</ul>
</div>
</div>

<div id="outline-container-org49e1312" class="outline-3">
<h3 id="org49e1312"><span class="section-number-3">1.3.</span> Configure native VIM</h3>
<div class="outline-text-3" id="text-1-3">
<p>
For all the given limitations, you&rsquo;ll need to find a solution. You can
either solve the issues one by one, or you can use a reference .vimrc
settings file that fix most of the issues out-of-the-box.
</p>

<ul class="org-ul">
<li><a href="https://github.com/theicfire/dotfiles/blob/master/vim/.vimrc">My
.vimrc file</a> could be a good starting point. Honestly, it&rsquo;s a bit old
and not the best. I now use VSCode mainly so I haven&rsquo;t kept a great
vimrc.</li>
</ul>
</div>

<div id="outline-container-org6500eb9" class="outline-4">
<h4 id="org6500eb9"><span class="section-number-4">1.3.1.</span> Using the system clipboard</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><code>"+y</code> copy a selection to the system clipboard</li>
<li><code>"+p</code> paste from the system clipboard</li>
<li>If this doesn&rsquo;t work, it&rsquo;s probably because Vim was not built with the
system clipboard option. To check, run <code>vim --version</code> and see if
<code>+clipboard</code> exists. If it says <code>-clipboard</code>, you will not be able to
copy from outside of Vim.
<ul class="org-ul">
<li>For Mac users, homebrew install Vim with the clipboard option.
Install homebrew and then run <code>brew install vim</code>.
<ul class="org-ul">
<li>then move the old Vim binary: <code>$ mv /usr/bin/vim /usr/bin/vimold</code></li>
<li>restart your terminal and you should see <code>vim --version</code> now with
<code>+clipboard</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5168236" class="outline-3">
<h3 id="org5168236"><span class="section-number-3">1.4.</span> Sublime Text</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Another option is to use Vintageous in Sublime Text (version 3). This
gives you Vim mode inside Sublime. I suggest this (or a similar setup
with the Atom editor) if you aren&rsquo;t a Vim master. Check out
<a href="advanced.html">Advanced Vim</a> if you are.</li>

<li>Vintageous is great, but I suggest you change a few settings to make
it better.

<ul class="org-ul">
<li>Clone <a href="https://github.com/theicfire/Vintageous">this repository</a>
to <code>~/.config/sublime-text-3/Packages/Vintageous</code>, or similar. Then
check out the &ldquo;custom&rdquo; branch.
<ul class="org-ul">
<li>Alternatively, you can get a more updated Vintageous version by
cloning <a href="https://github.com/guillermooo/Vintageous">the
official</a> repository and then copying over
<a href="https://github.com/theicfire/Vintageous/commit/19ff6311b01e3ae259b7eb8e3944687b42ba06ff">this
patch</a>.</li>
</ul></li>
<li>Change the user settings (<code>User/Preferences.sublime-settings</code>) to
include:
<ul class="org-ul">
<li><code>"caret_style": "solid"</code></li>
<li>This will make the cursor not blink, like in Vim.</li>
<li>Sublime Text might freeze when you do this. It&rsquo;s a bug; just
restart Sublime Text after changing the file.</li>
</ul></li>
<li><code>ctrl+r</code> in Vim means &ldquo;redo&rdquo;. But there is a handy Ctrl + R shortcut
in Sublime Text that gives an &ldquo;outline&rdquo; of a file. I remapped it to
alt+r by putting this in the User keymap
<ul class="org-ul">
<li><code>{ "keys": ["alt+r"], "command": "show_overlay", "args": {"overlay": "goto", "text": "@"} },</code></li>
</ul></li>
<li><a href="https://github.com/guillermooo/Vintageous/wiki/Toggling-Vintageous">Add
the ability to toggle Vintageous on and off</a></li>
<li>Mac users: you will not have the ability to hold down a navigation
key (like holding j to go down). To fix this, run the commands
specified here: <a href="https://gist.github.com/kconragan/2510186">https://gist.github.com/kconragan/2510186</a></li>
</ul></li>

<li>Now you should be able to restart sublime and have a great Vim
environment! Sweet Dude.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcea28ea" class="outline-3">
<h3 id="orgcea28ea"><span class="section-number-3">1.5.</span> Other</h3>
<div class="outline-text-3" id="text-1-5">
<p>
I don&rsquo;t personally use these yet, but I&rsquo;ve heard other people do!
</p>

<ul class="org-ul">
<li><code>:qa</code> - Quit all open tabs (thanks Vince Banzon)</li>
<li><code>:wa</code> - Write all open tabs (thanks Vince Banzon)</li>
<li><code>:wqa</code> - Write and quit all open tabs (thanks Brian Zick)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbcca343" class="outline-3">
<h3 id="orgbcca343"><span class="section-number-3">1.6.</span> Additional resources</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><a href="advanced.html">Advanced Vim</a></li>
<li><a href="http://www.amazon.com/Practical-Vim-Thought-Pragmatic-Programmers/dp/1934356980">Practical
Vim</a> is a fantastic resource on many of the useful hidden features of
vim.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yousuf Ali</p>
<p class="date">Created: 2023-04-12 Wed 16:16</p>
</div>
</body>
</html>